;
~
{ re:
    { id:  'kana.2.0@ions.iskitz.net'
    , by: ['mike.👨🏾‍💻.lee','kaito.🧑🏾‍🦱.lee']
    , in:  'san-jose.california.usa.earth'
    , on:  -8.20160812
    , to:  -8.20211208
    , at:  +2.0
    , is:  "the Japanese Hiragana, Katakana, and Romaji character sets with "
        +  "some characters replaced by emoji representing something "
        +  "containing their sound 😊"
    },

  kana: true,  //td: replace with is:"alphabet"

  hiragana:
    { gojuon:
        [ 'あ', 'か' , 'さ' , 'た'  , 'な'   , 'は'   , 'ま' , 'や'   , 'ら'  , 'わ'
        , 'い', 'き' , 'し' , 'ち'  , 'に'   , 'ひ'   , 'み'          , 'り'
        , 'う', 'く' , 'す' , 'つ'  , 'ぬ'   , 'ふ'   , 'む' , 'ゆ'   , 'る'  , 'を'
        , 'え', 'け' , 'せ' , 'て'  , 'ね'   , 'へ'   , 'め'          , 'れ'
        , 'お', 'こ' , 'そ' , 'と'  , 'の'   , 'ほ'   , 'も' , 'よ'   , 'ろ'  , 'ん'
        ],
      dakuten:
        [       'が' , 'ざ' , 'だ'           , 'ば'
        ,       'ぎ' , 'じ' , 'ぢ'           , 'び'
        ,       'ぐ' , 'ず' , 'づ'           , 'ぶ'
        ,       'げ' , 'ぜ' , 'で'           , 'べ'
        ,       'ご' , 'ぞ' , 'ど'           , 'ぼ'
        ],
      handakuten:
        [                                     'ぱ'
        ,                                     'ぴ'
        ,                                     'ぷ'
        ,                                     'ぺ'
        ,                                     'ぽ'
        ],
      sokuon:
        [ 'っ'],
      yoon:
        [      'きゃ', 'しゃ', 'ちゃ', 'にゃ' , 'ひゃ' , 'みゃ'        , 'りゃ'
        ,      'きゅ', 'しゅ', 'ちゅ', 'にゅ' , 'ひゅ' , 'みゅ'        , 'りゅ'
        ,      'きょ', 'しょ', 'ちょ', 'にょ' , 'ひょ' , 'みょ'        , 'りょ'
        ,      'ぎゃ', 'じゃ'                , 'びゃ'
        ,      'ぎゅ', 'じゅ'                , 'びゅ'
        ,      'ぎょ', 'じょ'                , 'びょ'
        ,                                     'ぴゃ'
        ,                                     'ぴゅ'
        ,                                     'ぴょ'
        ]
    }, //ひらがな

  katakana:
    { gojuon:
        [ 'ア', '🧑🏾‍🦱' , 'サ' , 'タ'  , 'ナ'   , 'ハ'   , '👨🏾‍🦱' , 'ヤ'   , 'ラ' , 'ワ'
        , '🧑🏾‍🦱', '🦊' , 'シ' , 'チ'  , 'ニ'   , '👩🏻'   , 'ミ'          , 'リ'
        , 'ウ', '🏎' , 'ス' , 'ツ'  , 'ヌ'   , 'フ'   , 'ム' , 'ユ'   , '👨🏾‍🦱' , 'ヲ'
        , 'エ', '👨🏾‍🦱' , 'セ' , 'テ'  , 'ネ'   , 'ヘ'   , 'メ'          , 'レ'
        , 'オ', '👩🏻' , 'ソ' , '🧑🏾‍🦱'  , 'ノ'   , 'ホ'   , 'モ' , 'ヨ'   , '👩🏻' , 'ン'
        ],
      dakuten:
        [       'ガ' , 'ザ' , 'ダ'           , '🦇'
        ,       'ギ' , 'ジ' , 'ヂ'           , 'ビ'
        ,       'グ' , 'ズ' , 'ヅ'           , 'ブ'
        ,       'ゲ' , 'ゼ' , 'デ'           , 'ベ'
        ,       'ゴ' , 'ゾ' , 'ド'           , 'ボ'
        ],
      handakuten:
        [                                     'パ'
        ,                                     'ピ'
        ,                                     'プ'
        ,                                     'ペ'
        ,                                     'ポ'
        ],
      sokuon:
        [ 'ッ'],
      yoon:
        [      'キャ', 'シャ', 'チャ', 'ニャ' , 'ヒャ' , 'ミャ'       , 'リャ'
        ,      'キュ', 'シュ', 'チュ', 'ニュ' , 'ヒュ' , 'ミュ'       , 'リュ'
        ,      'キョ', 'ショ', 'チョ', 'ニョ' , 'ヒョ' , 'ミョ'       , 'リョ'
        ,      'ギャ', 'ジャ'                , 'ビャ'
        ,      'ギュ', 'ジュ'                , 'ビュ'
        ,      'ギョ', 'ジョ'                , 'ビョ'
        ,                                     'ピャ'
        ,                                     'ピュ'
        ,                                     'ピョ'
        ]
    }, //カタカナ

  romaji:
    { gojuon:
        [ 'a', '🧑🏾‍🦱' , 'sa'  , 'ta' , 'na'   , 'ha'  , '👨🏾‍🦱'  , 'ya' , 'ra' , 'wa'
        , '🧑🏾‍🦱', 'ki' , 'shi' , 'chi', 'ni'   , '👩🏻'  , 'mi'         , 'ri'
        , 'u', 'ku' , 'su'  , 'tsu', 'nu'   , 'hu'  , 'mu'  , 'yu' , '👨🏾‍🦱' , 'wo'
        , 'e', '👨🏾‍🦱' , 'se'  , 'te' , 'ne'   , 'he'  , 'me'         , 're'
        , 'o', '👩🏻' , 'so'  , '🧑🏾‍🦱' , 'no'   , 'ho'  , 'mo'  , 'yo' , '👩🏻' , 'nn'
        ],
      dakuten:
        [      'ga' , 'za'  , 'da'          , 'ba'
        ,      'gi' , 'ji'  , 'ji'          , 'bi'
        ,      'gu' , 'zu'  , 'zu'          , 'bu'
        ,      'ge' , 'ze'  , 'de'          , 'be'
        ,      'go' , 'zo'  , 'do'          , 'bo'
        ],
      handakuten:
        [                                     'pa'
        ,                                     'pi'
        ,                                     'pu'
        ,                                     'pe'
        ,                                     'po'
        ],
      sokuon:
        [ 't'],
      yoon:
        [      'kya', 'sha' , 'cha', 'nya'  , 'hya' , 'mya'       , 'rya'
        ,      'kyu', 'shu' , 'chu', 'nyu'  , 'hyu' , 'myu'       , 'ryu'
        ,      'kyo', 'sho' , 'cho', 'nyo'  , 'hyo' , 'myo'       , 'ryo'
        ,      'gya', 'ja'                  , 'bya'
        ,      'gyu', 'ju'                  , 'byu'
        ,      'gyo', 'jo'                  , 'byo'
        ,                                     'pya'
        ,                                     'pyu'
        ,                                     'pyo'
        ]
    } //romaji
} //+kana

;