;

+
{ todos:
    [ "Add composed characters like ja:じゃ"
    ]
}

+
{ re:
    { id: "kana"
    , is: "The Japanese Hiragana, Katakana, and Romaji character sets."
    , by: "Michael Lee, @iskitz, iskitz.net"
    , at: "2016.01.15..27-08.00"
    , in: "san-jose.california.usa.earth"
    },

  hiragana:
    [ 'あ', 'か', 'さ' , 'た'  , 'な' , 'は' , 'ま', 'や', 'ら', 'わ'
    , 'い', 'き', 'し' , 'ち'  , 'に' , 'ひ' , 'み'      , 'り'
    , 'う', 'く', 'す' , 'つ'  , 'ぬ' , 'ふ' , 'む', 'ゆ', 'る', 'を'
    , 'え', 'け', 'せ' , 'て'  , 'ね' , 'へ' , 'め'      , 'れ'
    , 'お', 'こ', 'そ' , 'と'  , 'の' , 'ほ' , 'も', 'よ', 'ろ', 'ん'

          , 'が', 'ざ' , 'だ'        , 'ば'
          , 'ぎ', 'じ' , 'ぢ'        , 'び'
          , 'ぐ', 'ず' , 'づ'        , 'ぶ'
          , 'げ', 'ぜ' , 'で'        , 'べ'
          , 'ご', 'ぞ' , 'ど'        , 'ぼ'

                                    , 'ぱ'
                                    , 'ぴ'
                                    , 'ぷ'
                                    , 'ぺ'
                                    , 'ぽ'
    ],

  katakana:
    [ 'ア', 'カ', 'サ' , 'タ'  , 'ナ' , 'ハ' , 'マ', 'ヤ', 'ラ', 'ワ'
    , 'イ', 'キ', 'シ' , 'チ'  , 'ニ' , 'ヒ' , 'ミ'      , 'リ'
    , 'ウ', 'ク', 'ス' , 'ツ'  , 'ヌ' , 'フ' , 'ム', 'ユ', 'ル', 'ヲ'
    , 'エ', 'ケ', 'セ' , 'テ'  , 'ネ' , 'ヘ' , 'メ'      , 'レ'
    , 'オ', 'コ', 'ソ' , 'ト'  , 'ノ' , 'ホ' , 'モ', 'ヨ', 'ロ', 'ン'

          , 'ガ', 'ザ' , 'ダ'        , 'バ'
          , 'ギ', 'ジ' , 'ヂ'        , 'ビ'
          , 'グ', 'ズ' , 'ヅ'        , 'ブ'
          , 'ゲ', 'ゼ' , 'デ'        , 'ベ'
          , 'ゴ', 'ゾ' , 'ド'        , 'ボ'

                                    , 'パ'
                                    , 'ピ'
                                    , 'プ'
                                    , 'ペ'
                                    , 'ポ'
    ],

  romaji:
    [ 'a', 'ka', 'sa' , 'ta'  , 'na', 'ha', 'ma', 'ya', 'ra', 'wa'
    , 'i', 'ki', 'shi', 'chi' , 'ni', 'hi', 'mi'      , 'ri'
    , 'u', 'ku', 'su' , 'tsu' , 'nu', 'hu', 'mu', 'yu', 'ru', 'wo'
    , 'e', 'ke', 'se' , 'te'  , 'ne', 'he', 'me'      , 're'
    , 'o', 'ko', 'so' , 'to'  , 'no', 'ho', 'mo', 'yo', 'ro', 'nn'

         , 'ga', 'za' , 'da'        , 'ba'
         , 'gi', 'ji' , 'ji'        , 'bi'
         , 'gu', 'zu' , 'zu'        , 'bu'
         , 'ge', 'ze' , 'de'        , 'be'
         , 'go', 'zo' , 'do'        , 'bo'

                                    , 'pa'
                                    , 'pi'
                                    , 'pu'
                                    , 'pe'
                                    , 'po'
    ]
}//+kana

;